In [5]:
import pandas as pd

ImportError: Missing required dependencies ['numpy']

In [3]:
condan install pandas

SyntaxError: invalid syntax (<ipython-input-3-0117eb5c85b7>, line 1)

ImportError: cannot import name 'add_newdocs'

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("cat.csv")

In [4]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
# %load "cat.csv"
a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [24]:
pd.read_table("cat.csv",sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [25]:
pd.read_csv("cat.csv" , header=None)# default number aa jaaen ge header me (0,1,2,3..)

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [26]:
pd.read_csv("cat.csv",names=['a','b','c','d','message'])

   a   b   c   d  message
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [29]:
names=['a','b','c','d','message']

In [31]:
pd.read_csv("cat.csv",names=names,index_col='message',header=None)

         a   b   c   d
message
message  a   b   c   d
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [32]:
pd.read_csv('cat.csv', names=names, index_col='message') #agr hmne algse columns name da dia to pheli raw ko column ka hissa bna de ga

         a   b   c   d
message
message  a   b   c   d
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [ ]:
# %load "myindex.csv"
key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [35]:
parsed=pd.read_csv("myindex.csv",index_col=['key1','key2'])

In [36]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [37]:
l=[' A B C\n',
'aaa -0.264438 -1.026059 -0.619500\n',
'bbb 0.927272 0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
'ddd -0.871858 -0.348382 1.100491\n']

In [38]:
pd.DataFrame(l)

                                     0
0                              A B C\n
1  aaa -0.264438 -1.026059 -0.619500\n
2    bbb 0.927272 0.302904 -0.032399\n
3  ccc -0.264273 -0.386314 -0.217601\n
4   ddd -0.871858 -0.348382 1.100491\n

In [42]:
pd.read_table("vari_space.csv",sep="\s+")

      '         A         B          C\n',
0  'aaa -0.264438 -1.026059  -0.619500\n',
1  'bbb  0.927272  0.302904  -0.032399\n',
2  'ccc -0.264273 -0.386314  -0.217601\n',
3  'ddd -0.871858 -0.348382    1.100491\n'

In [43]:
pd.read_table("vari_space.csv",sep="\s+")

      '         A         B          C\n',
0  'aaa -0.264438 -1.026059  -0.619500\n',
1  'bbb  0.927272  0.302904  -0.032399\n',
2  'ccc -0.264273 -0.386314  -0.217601\n',
3  'ddd -0.871858 -0.348382    1.100491\n'

In [44]:
result=pd.read_csv("ex5.csv")
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [45]:
result.isnull()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [46]:
result = pd.read_csv('ex5.csv', na_values=['NULL'])

In [47]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [50]:
sentinels = {'message': ['foo'], 'something': ['two']}

In [51]:
pd.read_csv('ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [2]:
import pandas as pd
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
f=pd.DataFrame(data)

In [4]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
....: index=['one', 'two', 'three', 'four',
....: 'five', 'six'])

In [5]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [7]:
frame2.loc['five']

year       2002
state    Nevada
pop         2.9
debt        NaN
Name: five, dtype: object

In [12]:
frame2[0:4]

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN